requests/parent_control_lyra.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:types="http://www.deltasolutions.ru/om/rt/LyraOmsService/">
   <SOAP-ENV:Body>
      <types:SubmitOrderRequest>
         <Components>
            <Component>
               <Attributes>
                  <Attribute>
                     <Name>action_code</Name>
                     <Value>54</Value>
                  </Attribute>
                  <Attribute>
                     <Name>address</Name>
                     <Value>г. Екатеринбург; ул. Татищева</Value>
                  </Attribute>
                  <Attribute>
                     <Name>atbr_id</Name>
                     <Value>3</Value>
                  </Attribute>
                  <Attribute>
                     <Name>cfs_spec_id</Name>
                     <Value>parent_control</Value>
                  </Attribute>
                  <Attribute>
                     <Name>city</Name>
                     <Value>10465</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_birth_date</Name>
                     <Value>1991-01-01T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_birth_place</Name>
                     <Value>ГОРОД ГОРОД</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_id</Name>
                     <Value>31459646</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_name</Name>
                     <Value>ОМС ТЕСТ ОДИН</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_date</Name>
                     <Value>2001-01-01T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_num</Name>
                     <Value>123654</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_place</Name>
                     <Value>ГОРОД ГОРОД</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_pass_ser</Name>
                     <Value>3214</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_phone</Name>
                     <Value>3214569874</Value>
                  </Attribute>
                  <Attribute>
                     <Name>client_type</Name>
                     <Value>3</Value>
                  </Attribute>
                  <Attribute>
                     <Name>connection_scheme</Name>
                     <Value>93</Value>
                  </Attribute>
                  <Attribute>
                     <Name>contract_id</Name>
                     <Value>6559030</Value>
                  </Attribute>
                  <Attribute>
                     <Name>delivery_date</Name>
                     <Value>2015-10-12T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>department_id</Name>
                     <Value>3401</Value>
                  </Attribute>
                  <Attribute>
                     <Name>exec_date</Name>
                     <Value>2015-10-12T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>flat</Name>
                     <Value>2</Value>
                  </Attribute>
                  <Attribute>
                     <Name>house</Name>
                     <Value>123А</Value>
                  </Attribute>
                  <Attribute>
                     <Name>installation_date</Name>
                     <Value>2015-10-12T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>instance_id</Name>
                     <Value>86605256</Value>
                  </Attribute>
                  <Attribute>
                     <Name>jur_eak_id</Name>
                     <Value>26447237</Value>
                  </Attribute>
                  <Attribute>
                     <Name>local_idn_set</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>lyra_const_service_id</Name>
                     <Value>37343</Value>
                  </Attribute>
                  <Attribute>
                     <Name>lyra_one_time_service_id</Name>
                     <Value>23050</Value>
                  </Attribute>
                  <Attribute>
                     <Name>main_connection_scheme</Name>
                     <Value>171</Value>
                  </Attribute>
                  <Attribute>
                     <Name>main_instance_id</Name>
                     <Value>86605253</Value>
                  </Attribute>
                  <Attribute>
                     <Name>need_installation</Name>
                     <Value>0</Value>
                  </Attribute>
                  <Attribute>
                     <Name>nri_additional_code</Name>
                     <Value>100001</Value>
                  </Attribute>
                  <Attribute>
                     <Name>nri_rnabn</Name>
                     <Value>14546391</Value>
                  </Attribute>
                  <Attribute>
                     <Name>order_action_type</Name>
                     <Value>PR</Value>
                  </Attribute>
                  <Attribute>
                     <Name>order_start_date</Name>
                     <Value>2015-10-12T00:00:00+06:00</Value>
                  </Attribute>
                  <Attribute>
                     <Name>pack_id</Name>
                     <Value>100604</Value>
                  </Attribute>
                  <Attribute>
                     <Name>parent_cfs_spec_id</Name>
                     <Value>0</Value>
                  </Attribute>
                  <Attribute>
                     <Name>parent_virtual_number</Name>
                     <Value>77669999026</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_amount</Name>
                     <Value>0</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_id</Name>
                     <Value>150050</Value>
                  </Attribute>
                  <Attribute>
                     <Name>prcl_quant</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>rtpl_id</Name>
                     <Value>35939</Value>
                  </Attribute>
                  <Attribute>
                     <Name>run_billing</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>service_receiver</Name>
                     <Value>2</Value>
                  </Attribute>
                  <Attribute>
                     <Name>srls_id</Name>
                     <Value>100001</Value>
                  </Attribute>
                  <Attribute>
                     <Name>srls_quant</Name>
                     <Value>1</Value>
                  </Attribute>
                  <Attribute>
                     <Name>street</Name>
                     <Value>330890</Value>
                  </Attribute>
                  <Attribute>
                     <Name>subs_eak_id</Name>
                     <Value>26447237</Value>
                  </Attribute>
                  <Attribute>
                     <Name>technology</Name>
                     <Value>FTTx</Value>
                  </Attribute>
                  <Attribute>
                     <Name>tx_id</Name>
                     <Value>336437716</Value>
                  </Attribute>
               </Attributes>
            </Component>
         </Components>
         <CommonData>
            <Attributes>
               <Attribute>
                  <Name>main_virtual_number</Name>
                  <Value>143433028778</Value>
               </Attribute>
            </Attributes>
         </CommonData>
      </types:SubmitOrderRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>